In [9]:
import numpy as np
import pandas as pd
from datetime import timedelta
import math

from dateutil.relativedelta import *
from datetime import date
from datetime import datetime

def formatarStr (DataFrame, columns):
    for col in columns:
        DataFrame[col] = DataFrame[col].str.strip()

In [10]:
#ISO-8859-1
nomeArquivoOrigemUF = 'datasets/origem/MPS/ACT01.csv'
nomeArquivoResultadoUFRecentes = 'datasets/result/dados_UF_MPS_recentes.csv'
nomeArquivoResultadoUFTotal = 'datasets/result/dados_UF_MPS_total.csv'
nomeArquivoResultadoUFTotalAno = 'datasets/result/dados_UF_MPS_totalAno.csv'


columns_types = {'ano': str, 'uf': str, 'motivo"': str, 'qtde': str}

nomes  = ['ano', 'uf', 'motivo', 'qtde']

dados_originais = pd.read_csv(nomeArquivoOrigemUF, sep = ',', header=0, names=nomes, dtype=columns_types, encoding='ISO-8859-1')

df_original = pd.DataFrame(data = dados_originais, columns=nomes)
df_original.shape[0] #3195

3195

In [11]:
df_original.head()

    ano        uf          motivo   qtde
0  1988  Rondônia  Típico-Com Cat    592
1  1988      Acre  Típico-Com Cat    115
2  1988  Amazonas  Típico-Com Cat   5173
3  1988      Pará  Típico-Com Cat  12172
4  1988  Maranhão  Típico-Com Cat   5916

In [12]:
df_original.drop(['motivo'], axis=1, inplace = True)

formatarStr(df_original, ['ano', 'uf', 'qtde'])
df_original.dropna(subset = ['qtde'], inplace = True)
df_original.dropna(subset = ['ano'], inplace = True)
# 1 linha excluída

df_original['ano'] = df_original['ano'].apply(pd.to_numeric)
df_original['qtde'] = df_original['qtde'].apply(pd.to_numeric)

selecao2016 = df_original['ano'] >= 2016
df_recentes = df_original[selecao2016].copy()
df_recentes.shape[0] #441

441

In [13]:
df_recentes.head()

       ano        uf  qtde
2753  2016   Alagoas  2481
2754  2016   Alagoas    95
2755  2016   Alagoas   563
2756  2016  Amazonas  3620
2757  2016  Amazonas   353

In [14]:
df_recentes.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 441 entries, 2753 to 3193
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ano     441 non-null    int64
 1   uf      441 non-null    object
 2   qtde    441 non-null    int64
dtypes: int64(2), object(1)
memory usage: 13.8+ KB

In [15]:
df_result = pd.DataFrame(df_recentes.groupby(['uf', 'ano'], as_index=False)['qtde'].sum())
df_result.head()

        uf   ano  qtde
0     Acre  2016   973
1     Acre  2017   982
2     Acre  2018   862
3  Alagoas  2016  4534
4  Alagoas  2017  4175

In [16]:
df_result.shape[0] #81

81

In [17]:
df_result.to_csv(nomeArquivoResultadoUFRecentes, sep = ';', encoding='UTF-8')

In [18]:
df_original.head(30)

     ano                   uf    qtde
0   1988             Rondônia     592
1   1988                 Acre     115
2   1988             Amazonas    5173
3   1988                 Pará   12172
4   1988             Maranhão    5916
5   1988                Piauí     761
6   1988                Ceará    6117
7   1988  Rio Grande do Norte    3821
8   1988              Paraíba    2491
9   1988           Pernambuco   17186
10  1988              Alagoas    3155
11  1988              Sergipe    3962
12  1988                Bahia   18695
13  1988         Minas Gerais   91068
14  1988       Espírito Santo   11947
15  1988       Rio de Janeiro   83928
16  1988            São Paulo  419981
17  1988               Paraná   67303
18  1988       Santa Catarina   49680
19  1988    Rio Grande do Sul   93758
20  1988   Mato Grosso do Sul    4844
21  1988          Mato Grosso    2876
22  1988                Goiás   16963
23  1988     Distrito Federal    3850
24  1988             Rondônia      78
25  1988                 Acre      32
26  1988             Amazonas     540
27  1988                 Pará     495
28  1988             Maranhão     100
29  1988                Piauí      80

In [19]:
df_original.shape[0]

3194

In [20]:
df_original = pd.DataFrame(df_original.groupby(['uf', 'ano'], as_index=False)['qtde'].sum())
df_original.head()

     uf   ano  qtde
0  Acre  1988   147
1  Acre  1989   162
2  Acre  1990    98
3  Acre  1991   117
4  Acre  1992    70

In [21]:
df_original.shape[0] #816

816

In [22]:
df_original.to_csv(nomeArquivoResultadoUFTotalAno, sep = ';', encoding='UTF-8')

In [23]:
df_uf = pd.DataFrame(df_original.groupby(['uf'], as_index=False)['qtde'].sum())

In [24]:
df_uf = df_uf.sort_values(['qtde'], ascending = False)
df_uf.index = range(df_uf.shape[0])

df_uf.head(5)

                  uf     qtde
0          São Paulo  7149229
1       Minas Gerais  1895372
2  Rio Grande do Sul  1523704
3             Paraná  1270610
4     Rio de Janeiro  1195747

In [25]:
#salvando em um arquivo uma tabela com a qtde total de acidentes por UF de 1988 até 2016
df_uf.to_csv(nomeArquivoResultadoUFTotal, sep = ';', encoding='UTF-8')